CD2DPointU.op_Implicit~CPoint
Converts CD2DPointU to CPoint object.
Returns:
Current value of D2D point.

CD2DPointU.#ctor(System.UInt32,System.UInt32)
Constructs a CD2DPointU object from two UINT32 values.
uX: source X
uY: source Y

CD2DPointU.#ctor(D2D_POINT_2U!System.Runtime.CompilerServices.IsConst*)
Constructs a CD2DPointU from object D2D1_POINT_2U object.
pt: source point

CD2DPointU.#ctor(D2D_POINT_2U!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DPointU from object D2D1_POINT_2U object.
pt: source point

CD2DPointU.#ctor(CPoint!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DPointU object from CPoint object.
pt: source point

CD2DPointU
D2D1_POINT_2U wrapper